from test_tasks.tasks.tasks1.test import customers_technic
from test_tasks.tasks.tasks2.test import name_file


technic = [
    ("Ноутбук", 1500, "Татьяна", "89002001020"),
    ("Смартфон", 500, "Анна", "89202202325"),
    ("Проектор ", 300, "Андрей", "89505205656"),
    ("Принтер", 750, "Игорь", "89303303236"),
    ("Планшет", 2300, "Игорь", "89303303236"),
    ("Смартфон", 1000, "Андрей", "89505205656"),
    ("Ноутбук", 4800, "Татьяна", "89002001020"),
    ("Наушники", 780, "Марина", "89562002350"),
    ("Сканер", 550, "Сергей", "89808564559"),
    ("Планшет", 1200, "Анна", "89202202325"),
    ("Ноутбук", 1100, "Игорь", "89303303236"),
    ("Смартфон", 3500, "Татьяна", "89002001020"),
]

names = ["f", "dfgr", "wecdwfdv", "sdvdvss"]

if __name__ == "__main__":
    customers_technic(technic)
    name_file(names)
